hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
        <register>
          <name>max_q</name>
          <description>max value of  q_channel</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MAX</name>
              <description>Max value of  q_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Max value valid, write clear
0: max value is not valid
1: max value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>min_q</name>
          <description>min value of  q_channel</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MIN</name>
              <description>Min value of  q_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Min value valid, write clear
0: min value is not valid
1: min value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>thrs_i</name>
          <description>the offset setting for edge detection of the i_channel</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>THRS</name>
              <description>The offset setting for edge detection of the i_channel, signed number
…
2: the offset is 0x800000+2
1: the offset is 0x800000+1
0: the offset is 0x800000
-1: the offset is 0x800000-1
-2: the offset is 0x800000-2
…</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRS4ACC</name>
              <description>enable thrs data for accumulate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>thrs_q</name>
          <description>the offset setting for edge detection of the q_channel</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>THRS</name>
              <description>The offset setting for edge detection of the q_channel, signed number
…
2: the offset is 0x800000+2
1: the offset is 0x800000+1
0: the offset is 0x800000
-1: the offset is 0x800000-1
-2: the offset is 0x800000-2
…</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRS4ACC</name>
              <description>enable thrs data for accumulate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>edg_det_ctl</name>
          <description>the control for edge detection</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x000003F7</resetMask>
          <fields>
            <field>
              <name>HOLD</name>
              <description>The minimum edge distance  in sample
0:1 sample
1:2 sample
2:3 samples
…
63:64 samples</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>The continuous positive or negative number for edge detection
0: 1
1: 2
…
7: 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>acc_scaling</name>
          <description>scaling for accumulation result</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000010F</resetMask>
          <fields>
            <field>
              <name>TOXIC_LK</name>
              <description>Toxic accumulation data be removed control
1: enable
0: disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_SHIFT</name>
              <description>Accumulation value shift control, this is a sign number.
0: {acc[39],acc[38:8]}
1: {acc[39],acc[37:7]}
2: {acc[39],acc[36:6]}
…
7: {acc[39],acc[31:1]}
8: {acc[39],acc[30:0]}
9: acc/2^9
10: acc/2^10
…
15:acc/2^15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>exc_period</name>
          <description>period of excitation</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x00001770</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXC_PERIOD</name>
              <description>The num in clock cycle for period of excitation
0: invalid value
1:1 cycle
2:2 cycles
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sync_delay_i</name>
          <description>delay  setting in clock cycle for synchronous signal</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Delay  in clock cycle for synchronous signal, the value shoud less than half of exc_period.exc_period.
0: invalid value
1: 1 cycles
2: 2 cycles
...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>rise_delay_i</name>
          <description>delay in clock cycle between excitation synchrnous signal and rising edge of i_channel data</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RISE_DELAY</name>
              <description>Delay value on rising edge of  i_channel data
0: 1 cycle
1: 2 cycles
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>fall_delay_i</name>
          <description>delay in clock cycle between excitation synchrnous signal and falling edge of i_channel data</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FALL_DELAY</name>
              <description>Delay value on falling edge of  i_channel data
0: 1 cycle
1: 2 cycles
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sample_rise_i</name>
          <description>sample value on rising edge of rectify signal</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>sample value on rising edge of rectify signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sample_fall_i</name>
          <description>sample value on falling edge of rectify signal</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>sample value on falling edge of rectify signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>acc_cnt_i</name>
          <description>number of accumulation</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_NEG</name>
              <description>sample number during the negtive of rectify signal
1: 1
2: 2
…</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_POS</name>
              <description>sample number during the positive of rectify signal
1: 1
2: 2
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sign_cnt_i</name>
          <description>sample counter of opposite sign with rectify signal</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_NEG</name>
              <description>Positive sample counter during negative rectify signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_POS</name>
              <description>Negative sample counter during positive rectify signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sync_delay_q</name>
          <description>delay  setting in clock cycle for synchronous signal</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Delay  in clock cycle for synchronous signal, the value shoud less than half of exc_period.exc_period.
0: invalid value
1: 1 cycles
2: 2 cycles
...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>rise_delay_q</name>
          <description>delay in clock cycle between excitation synchrnous signal and rising edge of q_channel data</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RISE_DELAY</name>
              <description>Delay value on rising edge of  q_channel data
0: 1 cycle
1: 2 cycles
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>fall_delay_q</name>
          <description>delay in clock cycle between excitation synchrnous signal and falling edge of q_channel data</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FALL_DELAY</name>
              <description>Delay value on falling edge of  q_channel data
0: 1 cycle
1: 2 cycles
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sample_rise_q</name>
          <description>sample value on rising edge of rectify signal</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>sample value on rising edge of rectify signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sample_fall_q</name>
          <description>sample value on falling edge of rectify signal</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>sample value on falling edge of rectify signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>acc_cnt_q</name>
          <description>number of accumulation</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_NEG</name>
              <description>sample number during the negtive of rectify signal
1: 1
2: 2
…</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_POS</name>
              <description>sample number during the positive of rectify signal
1: 1
2: 2
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sign_cnt_q</name>
          <description>sample counter of opposite sign with rectify signal</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_NEG</name>
              <description>Positive sample counter during negative rectify signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_POS</name>
              <description>Negative sample counter during positive rectify signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>amp_max</name>
          <description>the maximum of acc amplitude</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x01000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX</name>
              <description>the maximum of acc amplitude</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>amp_min</name>
          <description>the minimum of acc amplitude</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIN</name>
              <description>the minimum of acc amplitude</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_en</name>
          <description>the interrupt mask control</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000FFFF</resetMask>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>enable interrupt output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_I_EN</name>
              <description>i_channel accumulate valid interrupt enable for i_channel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_Q_EN</name>
              <description>q_channel accumulate valid interrupt enable for i_channel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISING_DELAY_I_EN</name>
              <description>i_channel delayed rectify signal rising edge interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLING_DELAY_I_EN</name>
              <description>i_channel delayed rectify signal falling edge interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISING_DELAY_Q_EN</name>
              <description>q_channel delayed rectify signal rising edge interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLING_DELAY_Q_EN</name>
              <description>q_channel delayed rectify signal falling edge interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RISING_I_EN</name>
              <description>i_channel rising edge interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_FALLING_I_EN</name>
              <description>i_channel falling edge interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RISING_Q_EN</name>
              <description>q_channel rising edge interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_FALLING_Q_EN</name>
              <description>q_channel falling edge interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_I_OVH_EN</name>
              <description>i_channel accumulate overflow interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_Q_OVH_EN</name>
              <description>q_channel accumulate overflow interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_I_OVL_EN</name>
              <description>i_channel accumulate underflow interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_VLD_Q_OVL_EN</name>
              <description>q_channel accumulate underflow interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_AMP_OVH_EN</name>
              <description>accumulate ample overflow interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_AMP_OVL_EN</name>
              <description>accumulate ample underflow interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
