hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
        <register>
          <name>id_negedge</name>
          <description>negedge order Id value</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_NEGEDGE</name>
              <description>negedge order Id value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>iq_negedge</name>
          <description>negedge order Iq value</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IQ_NEGEDGE</name>
              <description>negedge order Iq value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>alpha_posedge</name>
          <description>posedge order alpha value</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALPHA_POSEDGE</name>
              <description>posedge order alpha value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>beta_posedge</name>
          <description>posedge order beta value</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BETA_POSEDGE</name>
              <description>posedge order beta value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>alpha_negedge</name>
          <description>negedge order alpha value</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALPHA_NEGEDGE</name>
              <description>negedge order alpha value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>beta_negedge</name>
          <description>negedge order beta value</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BETA_NEGEDGE</name>
              <description>negedge order beta value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>timestamp_locked</name>
          <description>timestamp_locked</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMESTAMP_LOCKED</name>
              <description>timestamp_locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>debug_status0</name>
          <description>debug_status0</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>VALUE_A_COUNTER</name>
              <description>value_a_counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE_B_COUNTER</name>
              <description>value_b_counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE_C_COUNTER</name>
              <description>value_c_counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="VSC0">
      <name>VSC1</name>
      <description>VSC1</description>
      <groupName>VSC</groupName>
      <baseAddress>0xf04a4000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CLC0</name>
      <description>CLC0</description>
      <groupName>CLC</groupName>
      <baseAddress>0xf04b0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <dimIndex>vd,vq</dimIndex>
          <name>VDVQ_CHAN[%s]</name>
          <description>no description available</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>mode</name>
            <description>&amp;index0 mode ctrl</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x810107FF</resetMask>
            <fields>
              <field>
                <name>ENABLE_CLC</name>
                <description>enable CLC</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MASK_MODE</name>
                <description>open mode: CLC keep working even if bad irq status ocurred</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DQ_MODE</name>
                <description>dq mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_IRQ</name>
                <description>enable irq:
irq_data_in_forbid     , // 10
irq_forb_err_boundary  , // 9
irq_p3z3_over_lo       , // 8
irq_p3z3_over_hi       , // 7
irq_p3z3_err_boundary  , // 6
irq_z2_over_sf         , // 5
irq_z2_over_lo         , // 4
irq_z2_over_hi         , // 3
irq_z2_err_boundary    , // 2
irq_coef_err_boundary  , // 1
irq_valid_clc            // 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>adc_expect</name>
            <description>&amp;index0 adc expect</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_EXPECT</name>
                <description>adc expect value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>adc_chan</name>
            <description>&amp;index0 adc used channel</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>ADC_CHAN</name>
                <description>adc used chan ID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>adc_offset</name>
            <description>&amp;index0 adc used offset</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_OFFSET</name>
                <description>adc used offset</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_lowth</name>
            <description>&amp;index0 eadc_lowth value used in error adc cofficient selection</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_LOWTH</name>
                <description>if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_highth</name>
            <description>&amp;index0 eadc_highth value used in error adc cofficient selection</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_HIGHTH</name>
                <description>if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_midlowth</name>
            <description>&amp;index0 eadc_midlowth value used in error adc cofficient selection</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_MIDLOWTH</name>
                <description>if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_midhighth</name>
            <description>&amp;index0 eadc_midhighth value used in error adc cofficient selection</description>
            <addressOffset>0x1c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_MIDHIGHTH</name>
                <description>if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p2z2_clamp_lo</name>
            <description>&amp;index0 2p2z output clamp low threshold</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>2P2Z_CLAMP_LO</name>
                <description>2p2z output clamp low threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p2z2_clamp_hi</name>
            <description>&amp;index0 2p2z output clamp high threshold</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>2P2Z_CLAMP_HI</name>
                <description>2p2z output clamp high threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_clamp_lo</name>
            <description>&amp;index0 3p3z output clamp low threshold</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_CLAMP_LO</name>
                <description>3p3z output clamp low threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_clamp_hi</name>
            <description>&amp;index0 3p3z output clamp high threshold</description>
            <addressOffset>0x2c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_CLAMP_HI</name>
                <description>3p3z output clamp high threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>3</dim>
            <dimIncrement>0x20</dimIncrement>
            <dimIndex>0,1,2</dimIndex>
            <name>COEFF[%s]</name>
            <description>no description available</description>
            <addressOffset>0x40</addressOffset>
            <register>
              <name>coeff_b0</name>
              <description>&amp;index0 zone &amp;index1 b0</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_B0</name>
                  <description>coefficient b0</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_b1</name>
              <description>&amp;index0 zone &amp;index1 b1</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_B1</name>
                  <description>coefficient b1</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_b2</name>
              <description>&amp;index0 zone &amp;index1 b2</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_B2</name>
                  <description>coefficient b2</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_b3</name>
              <description>&amp;index0 zone &amp;index1 b3</description>
              <addressOffset>0xc</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_B3</name>
                  <description>coefficient b3</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_a0</name>
              <description>&amp;index0 zone &amp;index1 a0</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_A0</name>
                  <description>coefficient a0</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_a1</name>
              <description>&amp;index0 zone &amp;index1 a1</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_A1</name>
                  <description>coefficient a1</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_a2</name>
              <description>&amp;index0 zone &amp;index1 a2</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>COEFF_A2</name>
                  <description>coefficient a2</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>coeff_ks</name>
              <description>&amp;index0 zone &amp;index1 kscaling</description>
              <addressOffset>0x1c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0000001F</resetMask>
              <fields>
                <field>
                  <name>COEFF_KSCALING</name>
                  <description>coefficient kscaling</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>5</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>pwm_period</name>
            <description>&amp;index0 pwm_period</description>
            <addressOffset>0xa0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PWM_PERIOD</name>
                <description>pwm_period</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>output_value</name>
            <description>&amp;index0 output value</description>
            <addressOffset>0xa4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OUTPUT_VALUE</name>
                <description>output_value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>timestamp</name>
            <description>&amp;index0 adc timestamp used</description>
            <addressOffset>0xa8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIMESTAMP</name>
                <description>timestamp</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_curr</name>
            <description>&amp;index0 error adc latest value</description>
            <addressOffset>0xac</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_CURR</name>
                <description>error adc latest value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
