hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
        <register>
          <name>CPU_PORT_EGRESS_FRER_LatTestPeriod</name>
          <description>No description available</description>
          <addressOffset>0x1294c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>FLATT</name>
              <description>frerSeqRcvyLatentErrorPeriod (802.1CB 10.4.1.12.2)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_EGRESS_FRER_LatErrDiffAlw</name>
          <description>No description available</description>
          <addressOffset>0x12950</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDIFF</name>
              <description>frerSeqRcvyLatentErrorDifference (802.1CB 10.4.1.12.1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_EGRESS_FRER_LatErrCnt</name>
          <description>No description available</description>
          <addressOffset>0x12954</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LATERR</name>
              <description>Counter – latent error detect. Write any value to clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>CPU_PORT_EGRESS_FRER_CNT0,CPU_PORT_EGRESS_FRER_CNT1,CPU_PORT_EGRESS_FRER_CNT2,CPU_PORT_EGRESS_FRER_CNT3,CPU_PORT_EGRESS_FRER_CNT4,CPU_PORT_EGRESS_FRER_CNT5,CPU_PORT_EGRESS_FRER_CNT6,CPU_PORT_EGRESS_FRER_CNT7</dimIndex>
          <name>EGFRCNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x12960</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Frame counters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_FDMEM_CNT_BYTE</name>
          <description>No description available</description>
          <addressOffset>0x14000</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDMEM_CNT_BYTE</name>
              <description>Number of bytes stored in frame drop FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_FDMEM_STS</name>
          <description>No description available</description>
          <addressOffset>0x14004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F0F</resetMask>
          <fields>
            <field>
              <name>WAIT_FOR_LU</name>
              <description>FD FIFO waits for LookUp information.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAIT_FOR_FRAME</name>
              <description>FD FIFO waits for more frame data.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>FD FIFO processes data.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>FD FIFO ready to work or working.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FULL</name>
              <description>FD FIFO full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AMST_FULL</name>
              <description>FD FIFO almost full. Less than 1600 Byte left.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AMST_EMPTY</name>
              <description>FD FIFO almost empty. Few bytes in FIFO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>FD FIFO empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_ERROR_FLAG</name>
          <description>No description available</description>
          <addressOffset>0x14008</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>LU_DESC_ERR</name>
              <description>LookUp Descriptor lost, because of unknown frame burst by MAC. If there is no  MAC mailfunction then this flag will never be raised. FDFIFO requires reset.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRFAIL_FULL</name>
              <description>Set if a frame is partially written into FIFO which had insufficient space. The frame is cut and frame error is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DROP_NRDY</name>
              <description>Frame was dropped because the FIFO was not ready. That can typically happen after a reset of the FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DROP_FULL_DESC</name>
              <description>Frame was dropped because the internal descriptor FIFO is full. Full by too many frames.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DROP_FULL_MEM</name>
              <description>Frame was dropped because the FIFO is full. Full by too much data.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_NRDY_ERR</name>
              <description>FD FIFO failure. Descriptor not received correctly.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_SEQ_ERR</name>
              <description>FD FIFO failure. Internal controller lost synchronization.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_IE_ERROR_FLAG</name>
          <description>No description available</description>
          <addressOffset>0x1400c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>IE</name>
              <description>Interrupt enable of ERROR_FLAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_IN_CONFIG</name>
          <description>No description available</description>
          <addressOffset>0x14010</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>NOCUT_ERROR</name>
              <description>FD_FIFO does not shorten frames which contain an error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_OUT_CONFIG</name>
          <description>No description available</description>
          <addressOffset>0x14014</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF037F</resetMask>
          <fields>
            <field>
              <name>DROP_DEST</name>
              <description>Bit mapped Destination for dropped frames. Typically, frames are cleared at destination 0. Use another value to stream frames for analysis. Supports only max range of port[15:0].</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIRROR_TX_EN</name>
              <description>Incoming frames of this port will be mirrored to the given destination in MIRROR if their destination match with MIRROR_TX.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIRROR_RX_EN</name>
              <description>Incoming frames of this port will be mirrored to the given destination in MIRROR_RX.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CT_FPE_OVRD</name>
              <description>If any Store&amp;Forward option in RX_FDFIFO is set then this flag will still force preemptable traffic to be forwarded in Cut-Through mode. This is a useful option to save latency by double buffering if the used MAC/TSN-EP already does S&amp;F.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable input of FD FIFO. Take care that also descriptor generation of LookUp is disabled. Remaining frames should be cleared with DROP_ALL.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DROP_ALL</name>
              <description>Route all frames to DROP_DEST.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_TO_CPU</name>
              <description>Send error frames to CPU.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIRROR_TO_CPU</name>
              <description>Duplicate frames to CPU.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NODROP_ERROR</name>
              <description>Do not drop frame errors.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_STORE_FW</name>
              <description>Switch between Cut-Through and Store&amp;Forward mode. 0 - Cut-Through 1 - Store&amp;Forward</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_RESET</name>
          <description>No description available</description>
          <addressOffset>0x14018</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>SOFTRS</name>
              <description>Write 1 to reset FD controller and memory pointers. Register Map content remains untouched</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_PARAM</name>
          <description>No description available</description>
          <addressOffset>0x1401c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LU_FIFO_DEPTH</name>
              <description>Number of MAC lookup descriptors the FIFO can store.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_DESC_FIFO_DESC</name>
              <description>Number of FD descriptors the FIFO can store. Two descriptors need to be stored per frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_FIFO_DESC</name>
              <description>Number of words (4byte) the Frame Drop FIFO can store.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_STRFWD</name>
          <description>No description available</description>
          <addressOffset>0x14020</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>If selected port is set then the frame is transmitted in Store &amp; Forward mode. This is necessary when the ingress rate of this port is slower than the egress rate of the transmitting port. In S&amp;F, the ingress module is able to drop frames with bad CRC.bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_PORTMASK</name>
          <description>No description available</description>
          <addressOffset>0x14024</addressOffset>
          <size>32</size>
          <resetValue>0x001FFFFF</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>Port grouping via port mask. If the selected port is not set then the destination will be filtered out. This register allows the realization of port-based-VLAN (no VLAN tags required, only set it by ports).
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_MIRROR</name>
          <description>No description available</description>
          <addressOffset>0x14028</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>Mirror Port. If port mirroring is enabled TX/RX traffic will also be forwarded to this port.
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_RX_FDFIFO_MIRROR_TX</name>
          <description>No description available</description>
          <addressOffset>0x1402c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>PORT</name>
              <description>Mirror Selection TX. The destination of the frame is compared with this vector. All matching TX probe ports will be mirrored to MIRROR. It is necessary to configure all ingress ports to mirror the complete TX traffic.
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_ESELECT</name>
          <description>Stream Identification</description>
          <addressOffset>0x14800</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>ESEL</name>
              <description>Select entry. Selected entry mapped to 0x40 – 0x5C.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_CONTROL</name>
          <description>No description available</description>
          <addressOffset>0x14840</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SID</name>
              <description>Stream ID – inserted to header on match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQGEN</name>
              <description>Sequence number generation enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTCTL</name>
              <description>Active Destination MAC – control. See Table 6-6.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMAC</name>
              <description>0: Lookup by Destination MAC 1: Lookup by Source MAC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Lookup mode. 1:Priority – a frame must be untagged or priority tagged ; 2:Tagged – a frame must have a VLAN tag ; 3:All – a frame can be tagged or untagged</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_SEQNO</name>
          <description>No description available</description>
          <addressOffset>0x14844</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SEQNO</name>
              <description>Sequence number – next number when generating,any write access to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_MATCHCNT</name>
          <description>No description available</description>
          <addressOffset>0x14848</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATCH</name>
              <description>Entry match counter – any write access to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_MACLO</name>
          <description>No description available</description>
          <addressOffset>0x14850</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACL</name>
              <description>MAC-Address [31:0] used by lookup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
