hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
        <register>
          <name>CPU_PORT_IGRESS_STMID_MACHI</name>
          <description>No description available</description>
          <addressOffset>0x14854</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>VID</name>
              <description>VLAN ID used by lookup.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>MAC-Address [47:31] used by lookup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_AMACLO</name>
          <description>No description available</description>
          <addressOffset>0x14858</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AMACL</name>
              <description>Active Destination MAC, MAC-Address [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_STMID_AMACHI</name>
          <description>No description available</description>
          <addressOffset>0x1485c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APCP</name>
              <description>Active Destination MAC, PCP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVID</name>
              <description>Active Destination MAC, VLAN ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMACH</name>
              <description>Active Destination MAC, MAC-Address [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_CONTROL</name>
          <description>Frame Replication and Elimination</description>
          <addressOffset>0x14900</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LATER</name>
              <description>Latent error flag – write 1 to clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTENC</name>
              <description>R-TAG encoding enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_SIDSEL</name>
          <description>No description available</description>
          <addressOffset>0x14904</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SID</name>
              <description>Stream ID selection for host access to IRFUNC and SRFUNC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_IRFUNC</name>
          <description>No description available</description>
          <addressOffset>0x14908</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>FEN</name>
              <description>Individual recovery function: FEN – enable function for stream SIDSEL.SID. FIDX – function index for stream SIDSEL.SID If function does not exists (FIDX &gt;= 2**FD), FEN will be set to 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIDX</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_SRFUNC</name>
          <description>No description available</description>
          <addressOffset>0x1490c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>FEN</name>
              <description>Sequence recovery function: FEN – enable function for stream SIDSEL.SID. FIDX – function index for stream SIDSEL.SID If function does not exists (FIDX &gt;= 2**FD), FEN will be set to 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIDX</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_FSELECT</name>
          <description>No description available</description>
          <addressOffset>0x14910</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>FIDX</name>
              <description>Recovery function selection for host access at offset 0x140+</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_FCTRL</name>
          <description>No description available</description>
          <addressOffset>0x14940</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80FFFFFF</resetMask>
          <fields>
            <field>
              <name>FRSET</name>
              <description>Reset recovery function – self-resetting to 0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PATHS</name>
              <description>Number of paths (used by latent error detection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN</name>
              <description>History length (used by Vector recovery algorithm)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGO</name>
              <description>Recovery function algorithm: 0 – Vector recovery algorithm 1 – Match recovery algorithm</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATEN</name>
              <description>Latent error detection enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IND</name>
              <description>Individual function (802.1CB 10.4.1.10)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TNS</name>
              <description>TakeNoSequence (802.1CB 10.4.1.9)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_RESETMSEC</name>
          <description>No description available</description>
          <addressOffset>0x14944</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>FSRMS</name>
              <description>frerSeqRcvyResetMSec (802.1CB 10.4.1.7)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_LatRsPeriod</name>
          <description>No description available</description>
          <addressOffset>0x14948</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>FLATR</name>
              <description>frerSeqRcvyLatentResetPeriod (802.1CB 10.4.1.12.4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_LatTestPeriod</name>
          <description>No description available</description>
          <addressOffset>0x1494c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>FLATT</name>
              <description>frerSeqRcvyLatentErrorPeriod (802.1CB 10.4.1.12.2)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_LatErrDiffAlw</name>
          <description>No description available</description>
          <addressOffset>0x14950</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDIFF</name>
              <description>frerSeqRcvyLatentErrorDifference (802.1CB 10.4.1.12.1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_IGRESS_FRER_LatErrCnt</name>
          <description>No description available</description>
          <addressOffset>0x14954</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LATERR</name>
              <description>Counter – latent error detect. Write any value to clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>CPU_PORT_IGRESS_FRER_CNT0,CPU_PORT_IGRESS_FRER_CNT1,CPU_PORT_IGRESS_FRER_CNT2,CPU_PORT_IGRESS_FRER_CNT3,CPU_PORT_IGRESS_FRER_CNT4,CPU_PORT_IGRESS_FRER_CNT5,CPU_PORT_IGRESS_FRER_CNT6,CPU_PORT_IGRESS_FRER_CNT7</dimIndex>
          <name>IGFRCNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x14960</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Frame counters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_CTRL</name>
          <description>No description available</description>
          <addressOffset>0x18004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enables counter. If deasserted the counter process stops and the counters hold their value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RESET</name>
          <description>No description available</description>
          <addressOffset>0x18008</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RSRX</name>
              <description>Write '1' to reset all RX counters.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTX</name>
              <description>Write '1' to reset all TX counters</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSALL</name>
              <description>Write '1' to reset all TX&amp;RX counters.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_PARAM</name>
          <description>No description available</description>
          <addressOffset>0x1800c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF7F</resetMask>
          <fields>
            <field>
              <name>RX_CNT_EN_VEC</name>
              <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter are available.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CNT_EN_VEC</name>
              <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter are available.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNTW</name>
              <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter
are available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_TX_COUNTER_TX_FGOOD</name>
          <description>No description available</description>
          <addressOffset>0x18010</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_FGOOD</name>
              <description>Good transmitted Frames to TX TSN-EP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_TX_COUNTER_TX_FERROR</name>
          <description>No description available</description>
          <addressOffset>0x18018</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_FERROR</name>
              <description>Transmitted Frames with Error to TX TSN-EP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_TX_COUNTER_TX_DROP_OVFL</name>
          <description>No description available</description>
          <addressOffset>0x18020</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DROP_OVFL</name>
              <description>Dropped frames by full queue of TSN-EP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_FGOOD</name>
          <description>No description available</description>
          <addressOffset>0x18040</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FGOOD</name>
              <description>Good received frame by ingress buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_FERROR</name>
          <description>No description available</description>
          <addressOffset>0x18048</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FERROR</name>
              <description>Bad received frame by ingress buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_KNOWN</name>
          <description>No description available</description>
          <addressOffset>0x18050</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_KNOWN</name>
              <description>Number of frames passed ingress with hit by MAC Table. This includes Broadcast and non-relayed frames.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_UNKNOWN</name>
          <description>No description available</description>
          <addressOffset>0x18058</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_UNKNOWN</name>
              <description>Number of frames passed ingress without hit by MAC table.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_UC</name>
          <description>No description available</description>
          <addressOffset>0x18060</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_UC</name>
              <description>Number of unicast frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_INTERN</name>
          <description>No description available</description>
          <addressOffset>0x18068</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_INTERN</name>
              <description>Number of non-relay frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_BC</name>
          <description>No description available</description>
          <addressOffset>0x18070</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_BC</name>
              <description>Number of Broadcast frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PORT_MONITOR_RX_COUNTER_RX_MULTI</name>
          <description>No description available</description>
          <addressOffset>0x18078</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_MULTI</name>
              <description>Number of Multicast frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
