hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
          <register>
            <name>PORT1_QCH_ERR_CFG</name>
            <description>qch clear</description>
            <addressOffset>0x2810</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FF07</resetMask>
            <fields>
              <field>
                <name>CQF_QUE_ERR</name>
                <description>que gate error for each cqf</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CQF_NUM_CFG_ERR</name>
                <description>cqf_num config error</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AXIS_QCH_CFG_ERR</name>
                <description>axis_qch_en config error</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CQF_CLR_CTRL</name>
                <description>enable cqf buffer auto clear when error</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_CRSR</name>
            <description>No description available</description>
            <addressOffset>0x3000</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFF0F</resetMask>
            <fields>
              <field>
                <name>ADMINGS</name>
                <description>Admin gate states, fixed 0xFF. Gate states when TAS is disabled.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OPERGS</name>
                <description>Operational gate states of TQ[i] (i = 0 – TQC-1)
Bit[i]=0 – Gate is closed; no start of frame TX possible
Bit[i]=1 – Gate is open</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TAS_GPIO_STA</name>
                <description>operational tas gpio gate status of TQ[i]</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFGPEND</name>
                <description>Configuration change is pending – Admin basetime not yet reached.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFGERR</name>
                <description>Configuration error.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CFGCHG</name>
                <description>Switch configuration; Bit is automatically reset to 0;
Setting Bit=1 triggers configuration change event.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Enable time aware scheduling.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_ACYCLETM</name>
            <description>No description available</description>
            <addressOffset>0x3004</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTIME</name>
                <description>Admin cycletime in nanoseconds.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_ABASETM_L</name>
            <description>No description available</description>
            <addressOffset>0x3008</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASETM_L</name>
                <description>Admin basetime – nanoseconds and seconds part.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_ABASETM_H</name>
            <description>No description available</description>
            <addressOffset>0x300c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASETM_H</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_LISTLEN</name>
            <description>No description available</description>
            <addressOffset>0x3010</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00FF00FF</resetMask>
            <fields>
              <field>
                <name>OLISTLEN</name>
                <description>Oper list length.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ALISTLEN</name>
                <description>Admin list length.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_OCYCLETM</name>
            <description>No description available</description>
            <addressOffset>0x3014</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTIME</name>
                <description>Operational cycletime in nanoseconds</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_OBASETM_L</name>
            <description>No description available</description>
            <addressOffset>0x3018</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASETM_L</name>
                <description>Operational basetime – nanoseconds and seconds part. The operational basetime might occasionally have a non-normalized value (ns &gt;= 10^9) for one clock cycle.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TAS_OBASETM_H</name>
            <description>No description available</description>
            <addressOffset>0x301c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASETM_H</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSN_SHAPER_MXTK0,TSN_SHAPER_MXTK1,TSN_SHAPER_MXTK2,TSN_SHAPER_MXTK3,TSN_SHAPER_MXTK4,TSN_SHAPER_MXTK5,TSN_SHAPER_MXTK6,TSN_SHAPER_MXTK7</dimIndex>
            <name>MXTK[%s]</name>
            <description>no description available</description>
            <addressOffset>0x3020</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00FFFFFF</resetMask>
            <fields>
              <field>
                <name>TICK</name>
                <description>Maximum SDU size in clock ticks. MXTKi is only supported when TQC &gt; i, otherwise read-only with value 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSN_SHAPER_TXOV0,TSN_SHAPER_TXOV1,TSN_SHAPER_TXOV2,TSN_SHAPER_TXOV3,TSN_SHAPER_TXOV4,TSN_SHAPER_TXOV5,TSN_SHAPER_TXOV6,TSN_SHAPER_TXOV7</dimIndex>
            <name>TXOV[%s]</name>
            <description>no description available</description>
            <addressOffset>0x3040</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Transmission overrun counter; increments on transmission when gate is closed; any write access will clear register to 0. TXOVi is only supported when TQC &gt; i.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>256</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>ent0,ent1,ent2,ent3,ent4,ent5,ent6,ent7,ent8,ent9,ent10,ent11,ent12,ent13,ent14,ent15,ent16,ent17,ent18,ent19,ent20,ent21,ent22,ent23,ent24,ent25,ent26,ent27,ent28,ent29,ent30,ent31,ent32,ent33,ent34,ent35,ent36,ent37,ent38,ent39,ent40,ent41,ent42,ent43,ent44,ent45,ent46,ent47,ent48,ent49,ent50,ent51,ent52,ent53,ent54,ent55,ent56,ent57,ent58,ent59,ent60,ent61,ent62,ent63,ent64,ent65,ent66,ent67,ent68,ent69,ent70,ent71,ent72,ent73,ent74,ent75,ent76,ent77,ent78,ent79,ent80,ent81,ent82,ent83,ent84,ent85,ent86,ent87,ent88,ent89,ent90,ent91,ent92,ent93,ent94,ent95,ent96,ent97,ent98,ent99,ent100,ent101,ent102,ent103,ent104,ent105,ent106,ent107,ent108,ent109,ent110,ent111,ent112,ent113,ent114,ent115,ent116,ent117,ent118,ent119,ent120,ent121,ent122,ent123,ent124,ent125,ent126,ent127,ent128,ent129,ent130,ent131,ent132,ent133,ent134,ent135,ent136,ent137,ent138,ent139,ent140,ent141,ent142,ent143,ent144,ent145,ent146,ent147,ent148,ent149,ent150,ent151,ent152,ent153,ent154,ent155,ent156,ent157,ent158,ent159,ent160,ent161,ent162,ent163,ent164,ent165,ent166,ent167,ent168,ent169,ent170,ent171,ent172,ent173,ent174,ent175,ent176,ent177,ent178,ent179,ent180,ent181,ent182,ent183,ent184,ent185,ent186,ent187,ent188,ent189,ent190,ent191,ent192,ent193,ent194,ent195,ent196,ent197,ent198,ent199,ent200,ent201,ent202,ent203,ent204,ent205,ent206,ent207,ent208,ent209,ent210,ent211,ent212,ent213,ent214,ent215,ent216,ent217,ent218,ent219,ent220,ent221,ent222,ent223,ent224,ent225,ent226,ent227,ent228,ent229,ent230,ent231,ent232,ent233,ent234,ent235,ent236,ent237,ent238,ent239,ent240,ent241,ent242,ent243,ent244,ent245,ent246,ent247,ent248,ent249,ent250,ent251,ent252,ent253,ent254,ent255</dimIndex>
            <name>SHACL[%s]</name>
            <description>no description available</description>
            <addressOffset>0x3800</addressOffset>
            <register>
              <name>TSN_SHAPER_ACLIST_ENTRY_L</name>
              <description>No description available</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0003FFFF</resetMask>
              <fields>
                <field>
                  <name>TAS_GPIO</name>
                  <description>gate states for qch and ptp event source</description>
                  <bitOffset>10</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OP</name>
                  <description>gate operation:
0 – SetGateStates
1 – Set-And-Hold-MAC
2 – Set-And-Release-MAC
3 – undefined</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STATE</name>
                  <description>gate state vector;
1 – Gate is open</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TSN_SHAPER_ACLIST_ENTRY_H</name>
              <description>No description available</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TIME</name>
                  <description>Time interval, entry execution in in host clock ticks (&lt;sys_clk&gt;)</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>TSN_EP_VER</name>
            <description>No description available</description>
            <addressOffset>0xf000</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF00FF</resetMask>
            <fields>
              <field>
                <name>VER_HI</name>
                <description>major version number</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VER_LO</name>
                <description>minor version number</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VER_REV</name>
                <description>revision number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_CTRL</name>
            <description>No description available</description>
            <addressOffset>0xf004</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xC0000001</resetMask>
            <fields>
              <field>
                <name>FILTDIS</name>
                <description>Disable filtering of PTP frames (Ethertype = 0x88F7)</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PTP_1S_EN</name>
                <description>Enable PTPv2 1-step synchronization suppor</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IE_TSF</name>
                <description>TxTimestampFifo interrupt enable; interrupt will be set when IE_TSF=&lt;1&gt; and TSF_SR.USED&gt;0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_TXUF</name>
            <description>No description available</description>
            <addressOffset>0xf010</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>TX buffer underflow counter; incremented when any MAC runs out of data during transmission. The counter is cleared at any write access. The counter is shared by pMAC and eMAC. If underflow event occurs at the same time for pMAC and eMAC, it will be counted as one event.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_IPCFG</name>
            <description>No description available</description>
            <addressOffset>0xf014</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFC000000</resetMask>
            <fields>
              <field>
                <name>INCL_RTC</name>
                <description>IP core parameter “INCL_RTC”</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INCL_SHAP</name>
                <description>IP core parameter “INCL_SHAPER”</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INCL_FPE</name>
                <description>IP core parameter “INCL_FPE”</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INCL_TSF</name>
                <description>IP core parameter “INCL_TSF”</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INCL_TSYNC</name>
                <description>IP core parameter “INCL_TSYNC”</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INCL_1STEP</name>
                <description>IP core parameter “INCL_1STEP”</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_TSF_D0</name>
            <description>No description available</description>
            <addressOffset>0xf020</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TSF_NS</name>
                <description>Tx-Timestamp-Fifo, lower 32 bit part of local time (&lt;curtime&gt;) at the start of transmission of the packet. Usually nanoseconds part when used with included RTC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_TSF_D1</name>
            <description>No description available</description>
            <addressOffset>0xf024</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TSF_SEC</name>
                <description>Tx-Timestamp-Fifo, upper 32 bit part of the local time (&lt;curtime&gt;) at the start of the transmission of the packet. Usually seconds part when used with included RTC.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_TSF_D2</name>
            <description>No description available</description>
            <addressOffset>0xf028</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE0000007</resetMask>
            <fields>
              <field>
                <name>TSF_TQ</name>
                <description>Tx-Timestamp-Fifo, traffic queue &lt;tx_tqueue&gt; of sent packet</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TSF_USR</name>
                <description>Tx-Timestamp-Fifo, user sideband &lt;tx_tuser&gt; of sent packet; Note: any read to register will remove actual value from FIFO</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
