hpmicro/hpm_sdk/soc/HPM6E00/HPM6E8Y/HPM6E8Y_svd.xml
        <register>
          <name>ESC_DL_STAT</name>
          <description>ESC DL Status</description>
          <addressOffset>0x110</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFF7</resetMask>
          <fields>
            <field>
              <name>CP3</name>
              <description>Communication on Port 3:
0:No stable communication
1:Communication established</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP3</name>
              <description>Loop Port 3:
0:Open
1:Closed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CP2</name>
              <description>Communication on Port 2:
0:No stable communication
1:Communication established</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP2</name>
              <description>Loop Port 2:
0:Open
1:Closed</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CP1</name>
              <description>Communication on Port 1:
0:No stable communication
1:Communication established</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP1</name>
              <description>Loop Port 1:
0:Open
1:Closed</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CP0</name>
              <description>Communication on Port 0:
0:No stable communication
1:Communication established</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP0</name>
              <description>Loop Port 0:
0:Open
1:Closed</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLP3</name>
              <description>Physical link on Port 3:
0:No link
1:Link detected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLP2</name>
              <description>Physical link on Port 2:
0:No link
1:Link detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLP1</name>
              <description>Physical link on Port 1:
0:No link
1:Link detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLP0</name>
              <description>Physical link on Port 0:
0:No link
1:Link detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELD</name>
              <description>Enhanced Link detection:
0:Deactivated for all ports
1:Activated for at least one port
NOTE:EEPROM value is only transferred into this
register at first EEPROM load after power-on or
reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDS</name>
              <description>PDI Watchdog Status:
0:Watchdog expired
1:Watchdog reloaded</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPLC</name>
              <description>PDI operational/EEPROM loaded correctly:
0:EEPROM not loaded, PDI not
operational (no access to Process Data
RAM)
1:EEPROM loaded correctly, PDI
operational (access to Process Data
RAM)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AL_CTRL</name>
          <description>AL Control</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <resetValue>0x0001</resetValue>
          <resetMask>0x003F</resetMask>
          <fields>
            <field>
              <name>DI</name>
              <description>Device Identification:
0:No request
1:Device Identification request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIA</name>
              <description>Error Ind Ack:
0:No Ack of Error Ind in AL status register
1:Ack of Error Ind in AL status register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IST</name>
              <description>Initiate State Transition of the Device State
Machine:
1:Request Init State
3:Request Bootstrap State
2:Request Pre-Operational State
4:Request Safe-Operational State
8:Request Operational State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AL_STAT</name>
          <description>AL Status</description>
          <addressOffset>0x130</addressOffset>
          <size>16</size>
          <resetValue>0x0001</resetValue>
          <resetMask>0x003F</resetMask>
          <fields>
            <field>
              <name>DI</name>
              <description>Device Identification:
0:Device Identification not valid
1:Device Identification loaded</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EI</name>
              <description>Error Ind:
0:Device is in State as requested or Flag
cleared by command
1:Device has not entered requested State
or changed State as result of a local
action</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Actual State of the Device State Machine:
1:Init State
3:Bootstrap State
2:Pre-Operational State
4:Safe-Operational State
8:Operational State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AL_STAT_CODE</name>
          <description>AL Status Code</description>
          <addressOffset>0x134</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CODE</name>
              <description>AL Status Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RUN_LED_OVRD</name>
          <description>RUN LED Override</description>
          <addressOffset>0x138</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>EN_OVRD</name>
              <description>Enable Override:
0:Override disabled
1:Override enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LED_CODE</name>
              <description>LED code:
0x0:Off
0x1:Flash 1x
0x2-0xC:Flash 2x – 12x
0xD:Blinking
0xE:Flickering
0xF:On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_LED_OVRD</name>
          <description>ERR LED Override</description>
          <addressOffset>0x139</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>EN_OVRD</name>
              <description>Enable Override:
0:Override disabled
1:Override enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LED_CODE</name>
              <description>LED code:
0x0:Off
0x1-0xC:Flash 1x – 12x
0xD:Blinking
0xE:Flickering
0xF:On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_CTRL</name>
          <description>PDI Control</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI</name>
              <description>Process data interface:
0x00:Interface deactivated (no PDI)
0x01:4 Digital Input
0x02:4 Digital Output
0x03:2 Digital Input and 2 Digital Output
0x04:Digital I/O
0x05:SPI Slave
0x06:Oversampling I/O
0x07:EtherCAT Bridge (port 3)
0x08:16 Bit asynchronous Microcontroller
interface
0x09:8 Bit asynchronous Microcontroller
interface
0x0A:16 Bit synchronous Microcontroller
interface
0x0B:8 Bit synchronous Microcontroller
interface
0x10:32 Digital Input and 0 Digital Output
0x11:24 Digital Input and 8 Digital Output
0x12:16 Digital Input and 16 Digital Output
0x13:8 Digital Input and 24 Digital Output
0x14:0 Digital Input and 32 Digital Output
0x80:On-chip bus
Others:Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CFG</name>
          <description>ESC Configuration</description>
          <addressOffset>0x141</addressOffset>
          <size>8</size>
          <resetValue>0x01</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ELP3</name>
              <description>Enhanced Link port 3:
0:disabled (if bit 1=0)
1:enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELP2</name>
              <description>Enhanced Link port 2:
0:disabled (if bit 1=0)
1:enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELP1</name>
              <description>Enhanced Link port 1:
0:disabled (if bit 1=0)
1:enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELP0</name>
              <description>Enhanced Link port 0:
0:disabled (if bit 1=0)
1:enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDLIU</name>
              <description>Distributed Clocks Latch In Unit:
0:disabled (power saving)
1:enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCSOU</name>
              <description>Distributed Clocks SYNC Out Unit:
0:disabled (power saving)
1:enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELDAP</name>
              <description>Enhanced Link detection all ports:
0:disabled (if bits [7:4]=0)
1:enabled at all ports (overrides bits [7:4])</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEV_EMU</name>
              <description>Device emulation (control of AL status):
0:AL status register has to be set by PDI
1:AL status register will be set to value
written to AL control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_INFO</name>
          <description>PDI Information</description>
          <addressOffset>0x14e</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <fields>
            <field>
              <name>PDICN</name>
              <description>PDI configuration invalid:
0:PDI configuration ok
1:PDI configuration invalid</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDIA</name>
              <description>PDI active:
0:PDI not active
1:PDI active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECLFE</name>
              <description>ESC configuration area loaded from
EEPROM:
0:not loaded
1:loaded</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFABW</name>
              <description>DI function acknowledge by write:
0:Disabled
1:Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_CFG</name>
          <description>PDI Configuration</description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <resetValue>0x84</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BUS</name>
              <description>On-chip bus:
000:Intel® Avalon®
001:AXI®
010:Xilinx® PLB v4.6
100:Xilinx OPB
others:reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK</name>
              <description>On-chip bus clock:
0:asynchronous
1-31:synchronous multiplication factor
(N * 25 MHz)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_SL_CFG</name>
          <description>PDI Sync/Latch[1:0] Configuration</description>
          <addressOffset>0x151</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SYNC1_MAER</name>
              <description>SYNC1 mapped to AL Event Request
register 0x0220[3]:
0:Disabled
1:Enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC1_CFG</name>
              <description>SYNC1/LATCH1 configuration*:
0:LATCH1 input
1:SYNC1 output</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC1_ODP</name>
              <description>SYNC1 output driver/polarity:
00:Push-Pull active low
01:Open Drain (active low)
10:Push-Pull active high
11:Open Source (active high)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC0_MAER</name>
              <description>SYNC0 mapped to AL Event Request
register 0x0220[2]:
0:Disabled
1:Enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC0_CFG</name>
              <description>SYNC0/LATCH0 configuration*:
0:LATCH0 Input
1:SYNC0 Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC0_ODP</name>
              <description>SYNC0 output driver/polarity:
00:Push-Pull active low
01:Open Drain (active low)
10:Push-Pull active high
11:Open Source (active high)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_EXT_CFG</name>
          <description>PDI Extended Configuration</description>
          <addressOffset>0x152</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0703</resetMask>
          <fields>
            <field>
              <name>OCBST</name>
              <description>On-chip bus sub-type for AXI:
000:AXI3
001:AXI4
010:AXI4 LITE
others:reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPS</name>
              <description>Read prefetch size (in cycles of PDI width):
0:4 cycles
1:1 cycle (typical)
2:2 cycles
3:Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECAT_EVT_MSK</name>
          <description>ECAT Event Mask</description>
          <addressOffset>0x200</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MASK</name>
              <description>ECAT Event masking of the ECAT Event
Request Events for mapping into ECAT event
field of EtherCAT frames:
0:Corresponding ECAT Event Request
register bit is not mapped
1:Corresponding ECAT Event Request
register bit is mapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_AL_EVT_MSK</name>
          <description>PDI AL Event Mask</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK</name>
              <description>AL Event masking of the AL Event Request
register Events for mapping to PDI IRQ
signal:
0:Corresponding AL Event Request
register bit is not mapped
1:Corresponding AL Event Request
register bit is mapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECAT_EVT_REQ</name>
          <description>ECAT Event Request</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0FFD</resetMask>
          <fields>
            <field>
              <name>MV</name>
              <description>Mirrors values of each SyncManager Status:
0:No Sync Channel 0 event
1:Sync Channel 0 event pending
0:No Sync Channel 1 event
1:Sync Channel 1 event pending
…
0:No Sync Channel 7 event
1:Sync Channel 7 event pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALS_EVT</name>
              <description>AL Status event:
0:No change in AL Status
1:AL Status change
(Bit is cleared by reading out AL Status
0x0130:0x0131 from ECAT)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLS_EVT</name>
              <description>DL Status event:
0:No change in DL Status
1:DL Status change
(Bit is cleared by reading out DL Status
0x0110:0x0111 from ECAT)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCL_EVT</name>
              <description>DC Latch event:
0:No change on DC Latch Inputs
1:At least one change on DC Latch Inputs
(Bit is cleared by reading DC Latch event
times from ECAT for ECAT-controlled Latch
Units, so that Latch 0/1 Status
0x09AE:0x09AF indicates no event)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
